import './App.css'

function App() {
  return (
    <div className='min-h-[100dvh] w-full flex items-center justify-center [*]:mac-scrollbar'>
      <div className='container px-[20px] grid justify-center gap-y-[20px]'>
        <div className='prose dark:prose-invert'>
          <h1>@hyeon/tailwindcss-layer-shadow</h1>
          <h2>예시</h2>
        </div>
        <div className='dark:layer-shadow-x-dark-primary layer-shadow-x-light-primary relative'>
          <div className="prose dark:prose-invert whitespace-nowrap overflow-x-auto">
            <p>
              이벼가겐 하잉븼너바훈 엉바샀스기돠 마이는 갸읎으만 아증랸오할을 담하아으재에 순으의, 히뎐 디늤다. 일느쟈 압미욘읜는 비온을 쥿옥은 훠자아 롁껄마기에서 닥즈은지. 캐갇알기 유채던 아을븐수의 닌장버산나를 맘외포밀이죠 화갤랠시는 아락는다. 까아앨톨의 자호해가 네여엉이 버오라이로 기배코의 바크어다. 메팻됴껴혼 이레시셈하자 셔가아가 산나후다 스퍙시도에. 낟네멀은 됴헜가에가의 앙윙챈은은 으아홍너어, 므그밨하를 껑윈개고안지 유탰기가 이가착, 닌숸닌과, 겨긱 이사로써.<br/>
              잔느우 사니는 허긴믐 틴바호라면 갔돈바가에게 릴마낙헝벤의다. 베근여챌 올읩바짜소다 야뜌루스서는, 로눤드에 그이끼 헹라날아마로. 낵유자 가줄텨닥을 사잰른견엔을 읜고를, 갠진오요듀마코 헨남아이, 베다와 노겐고 시자상기다 든더톤미도. 뉜젔시나투창은 미븝아올루흠이 쓰디 걸은 사리지 모예 뇍딤죈. 폼당뎀슥자 헌밌수션이레마다 버티간에서 라거징 타어를 읜수안줘건단던 아가. 가 라던사겨허혈울희히의, 파맜딨의 심비긕은, 어할인 더고와 옽애천르의, 랑랜러브그하고. 앨추흠라곡과 진타답츠에 성티혀 라로찬뎁의 타무솨먹에게. 모주에기흘까 허걈잔빟이 얼신작인, 저초시락고 려옿치잔 잉타캔은 건쿻사사, 칼거를 낫록일옵에 지훙을, 호다흔뻬고.<br/>
              톨아다즈힌인 차익 우기는 재을다 트마흤울을 미거봥뭐가 디백의 참애몬한빈할에 침니언유다 밪갛래옵은, 라흘이다. 타헹는다 어살아아을문다 후나, 로까를 깐롮므익에 능아재즨의 자아기카뵈고사충자 돈게차악다. 로마져죈 지얄좌를 렁바다 샨운을 지사생으라면, 모힘도간에 다앤믑랏던가. 얼다일엉애뎜 타디줌스로 귱큽올도다 헤뵈애를 대욜저가 반회연라치가 즈걱산과 허오가 단플뎀온. 잣시반이요 아반빅이 트아는 갈리사짱입시다, 으코밸드에 석디즈항흐우단에서 일욶으라 다자면, 브엇에서. 옴쁘훠쿰이함옥은 딤느는 도아가, 칠잔나아서 우손라를 하쓰들헤고어. 더나어를 베닛의 로겐이 으르 러자아다. 와하갈아이를 쿠사닸아에 나믁이어 수가문올멕의 장바유어 디헤렝이티넬듯 다싀틘뱐 싄빔즈차미는 와담겐븐이.
            </p>
          </div>
        </div>
      </div>
    </div>
  )
}

export default App
